org/articles/wangfeng.org
#+TITLE: Wang Feng Memory Lecture Translation

* Intro

I encountered this lecture series on youtube after scrolling through some memory sports websites I was interested in. Specifically, there was a 7-part lecture given by Wang Feng, the once world memory champion, delivered entirely in Chinese with no subtitles. There was some frustration that no translation was provided, so I wanted to do something useful and use transcription tools to figure out what was in the lecture.

Discussion about these videos can be found in [[https://forum.artofmemory.com/t/wang-feng-memory-system/26868/43][this thread]]: 

The videos can be found here: [[https://www.youtube.com/watch?v=4cOOiJEB56I][part 1]], [[https://www.youtube.com/watch?v=p4YFpxW1j8w][part 2]], [[https://www.youtube.com/watch?v=bDzUIxixv-c][part 3]], [[https://www.youtube.com/watch?v=zxDyLCsy1Gw][part 4]], [[https://www.youtube.com/watch?v=9kXntpDDYEU][part 5]], [[https://www.youtube.com/watch?v=-JeCBndMMUc][part 6]], [[https://www.youtube.com/watch?v=bUxNwMsBcjs][part 7]].

Below is my attempt at turning this lecture into something readable in English. I used OpenAI Whisper to transcribe and then translate the lecture directly from the audio, and then used GPT-4 to format it into somewhat more readable paragraphs. There are some pretty obvious translation errors in the below, so I've added some screenshots + occasional inline commentary, as well as commentary at the end. For some of the slides, I asked my Chinese-speaking relatives 

tl;dr, this lecture is a pretty normal overview of standard fare memory techniques, and Wang Feng was just very good at using them compared to other competitors. There's not really significant alpha in this lecture, if that is what you are looking for, but if you want to introduce these topics to a chinese-speaking audience with examples more in line with their experience, it seems good.

* Lecture

** Introducing Wang Feng

This is a large-scale mental competition, the China Mental Competition. In this competition, Wang Feng, with his steady performance, has won 7 medals in the 10 major competitions. The overall ranking is tied with his master Yuan Wenkui, who became the overall runner-up in China. Last November, he participated in the World Mental Competition held in London, England. The World Mental Competition is the most influential national competition in the field of mental fitness.

In 2006, he participated in the World Mental Competition held in 30 countries around the world. He represents the world's highest level of international mental competition in mental fitness. Wang Feng, as the first participant, unexpectedly achieved excellent results, becoming the biggest black horse in the world. He is the youngest Chinese athlete in the world. He won the single world champion of the Chinese poker project and broke the world record with 1,984 numbers in an hour. Wang Feng is the fifth in the world and China's number one world mentalist. Wang Feng is the ninth in the world, and the first Chinese to enter the top 10 in the world.

Wang Feng is still working hard on mental fitness and is ready to compete in the World Mental Competition this year. In addition, Wang Feng is also a disciple of Zhaozhou, a high school student, and a world mentalist who has brought more to China. Next, let's give a round of applause to the world mentalist, Wang Feng. Thank you, everyone.

** Tao Te Ching Recall

Due to the delay in the lecture tonight, I think I need to give you an explanation. Actually, since I decided to hold this lecture, I have been struggling and struggling. After our association applied for the venue, I heard yesterday that Professor Ma Lianxiang of the School of Philosophy was going to give a lecture here. Later, the people of our association called the school committee and said that after the school committee learned about the situation, they decided to give the venue to our association. So this venue did indeed come from Guiyin. Today, I rushed over and put the computer down, but I couldn't turn it on. So I couldn't broadcast the lecture I prepared. Fortunately, there was a backup, so that I could give you a normal lecture tonight.

Since everyone has waited for me for so long, and came here to listen to my lecture, I can assure you that as long as you come here today, I will definitely let you gain something. I won't let you down. Thank you. Before I start the lecture, I guess many people are curious about my memory. So let's have a little performance first.

Today, I will be demonstrating memory techniques using Lao Tzu's 'Tao Te Ching'. We'll focus on two types of memory-related tasks. The first involves identifying specific content: you can ask me about the contents of any chapter or paragraph in the text, and I will tell you what it contains. This isn't about recalling the number of pages, but the actual content.

Alternatively, you can challenge my memory in a different way: mention any part of the text, and I will tell you exactly on which page and paragraph it appears. This will showcase my ability to recall the placement of text within the book.

As part of the demonstration, the relevant passages will be highlighted in black on the screen. You'll also see me writing down the page numbers corresponding to Lao Tzu's writings as I recall them. We have these two types of challenges prepared. If anyone has questions or would like to test my memory, please feel free to raise your hand. Let's begin.

/The rest of this segment is a back and forth between Wang Feng and the audience, most of which is inaudible. Ostensibly, he gets them correct./

