org/articles/wangfeng.org
** Memorizing Names and Faces

/note: there seems to be some missing transition here, but we are learning about names + faces memory now./

*Slide: a woman*

How do you feel when you see this woman? Do you like her? Yes, you do. I think when you see her, the first thing you'll say is "Wow, beautiful!" What are the characteristics of this woman? First of all, she has a smile on her face, right? And also, you may find she wears a lot of accessories, right? These are like candies. So, you can think of this woman when you see her, she has so many candies on her body, and you will laugh.

*Slide: a different woman*

Next one. How do you feel when you see this woman? Do you like her? Yes, you do. Wow, very good. You have already done the first step. She looks a bit dark, and this image... Let's see her name again. Xiao Zhang Fei. Xiao Zhang Fei. To remember her, you can remember the famous Zhang Fei. Maybe this is Zhang Fei's daughter, Xiao Zhang Fei.

Okay, let's see this one. How do you feel when you see this woman? Her face is very dark, right? This woman looks more serious. This one is more difficult than the previous one. Let's see her name again. Let's see her name again. Do you have any idea? Do you have any idea?

*Slide: a man crossing his arms*

Speaking of Jin, what do you think of this man? Qing Jin. Qing Jin. So when you think about it, the most important thing is to think of those abstract words as a specific name. For example, when you see Jin, if you want it to be specific, it must be Jin. Right? You want to visualize something related to the word 'Jin'. So, Hong, you can think of Hong. You can think of this person. You see, he is facing this way. In fact, it feels like he is standing next to a mirror. The outline outside is a square. So you can think of he is standing in front of a square red mirror to look at the mirror or to look at the mirror. He is a little serious.

/note: I believe there's some sort of wordplay here? It doesn't translate well/

*Slide: a man wearing sunglasses*

Okay, next one. Okay, next one. Come on, you can think of a name. This person has an outline. So, Guan Shi Qiang. Guan Shi, what do you think of? Guan Shi, has an outline. What? An outline of a soldier. An outline of a soldier. What do you think of? Your hair is too long, isn't it? Okay, Guan Shi, what else can you think of? Write it down. Okay, very good. Let's see. When you were a child, what did you see when you saw Guan Shi Yin? I mean, how did he look like Guan Shi Yin? I didn't expect that even Guan Shi Yin thought that his outline was very strong. Very strong, very beautiful, isn't it? So, this is Guan Shi Qiang.

Okay, now, let's go back to this person and see if you remember. Come on, put it down. You can put it down. Let me drink some water. Okay, now, let's see if we can remember what his name was tomorrow.

/Note: here they flip through the images, and the crowd murmurs seemingly following the anchors used to memorize all the names./

*Slide: Memorizing Peoples Names and Faces in Real Life*

*Large scale, multi-level information: sounds, feelings, smells/body odor, occupation, hobbies, location met, experiences*

Okay, now, when we meet a new person, we can use some characteristics of the person himself to help us. So, what are these characteristics? For example, the voice of a person can be very bright or very sweet. These are your own thoughts. Then, emotions. Look at this person. What kind of person do you think he is? Do you like him? Do you hate him? Something like this. Then, smell. What kind of perfume or other smells does he wear? Then, his hobbies, his experiences, all of these can be connected to his name. In other words, you can process his name with your thoughts. Then, when you think about it, you can connect it with your own thoughts.

The last one is that some people have a strange name. It sounds a little uncomfortable. In this case, you can ask people what the meaning of this name is. For example, if you talk about a topic, the other person will help you remember the other person's name. In general, if his name has such a meaning, he will be happy to share it with you, right? The other one is that the more you talk, the more you remember. For example, after you have finished talking to a certain person, and you are talking to the person next to you.

You can think about what he said just now. We can directly replace it with his name. For example, what did this person say? What do you think about this person? Do you like this person? You can replace it with his name. In this way, you can increase your impact. The other one is that when people hear your name, they will remember it and repeat it. They will also feel very happy. Therefore, you will have a better and more pleasant interaction in the future, right?

The fifth point is that you can make use of your meditation and review to make new memories. For example, after you have finished talking to him, you may have to start eating or doing something else in the middle. In this process, you can recall some characteristics of that person's name, that person's occupation, and so on. The last one is that you can go back to the photo and organize the video. You can write the message in the video and add it to your memory.

I want to emphasize that you will receive a lot of business cards in the future. I suggest that you organize the business cards in a special way. For example, you can organize them by occupation, age, and so on. In this way, when you encounter discrimination, you can easily find the person you want to find or help. If you take a business card and put it anywhere, when you encounter discrimination, you can easily find the person you want to find or help. You just need to pay attention to this.

/note: 'encounter discrimination' here seems to refer to needing to pick out a specific person you met./

