org/articles/wangfeng.org
** Using Pegs

Okay, let's move on to the next one. The next thing I want to teach you is a little bit of professionalism in memory.

*Slides:*

*01 - Tree*

First we see that the code for 1 is a tree. Why? Can you think of it? Yes, it looks like a 1, right? Could you think of it as a 0? It must be a 1, right?

*02 - Two Bells*

Two is the image of bells. Then the next one.

*03 - Tripod Stool*

Three, right? Can you think of it as anything else? 

*04 - Car with Four Wheels*

Then four. Four wheels.

*05 - Glove with 5 Fingers*

Five.

*06 - 6 Shooter Gun*

This one is a bit difficult. Is there anyone who knows it? Very good, I heard you: it's because there are 6 bullets in the gun.

*07 - Hoe (bent gardening tool)*

This one is the most popular in primary school.

*08 - Roller Blades (8 Wheels)*

Why is this one eight? Because of the wheels.

*09 - A cat (9 lives)*

Why is this 9? Oh, because cats have nine lives.

*10 - Baseball Bat + Ball (shaped like 10)*

Next. You don't have to say this. Now let's go back from 01 to 10. 01. 02. 03. 04. 05. 06. 07. 08. 09. 10. Remember it.

Have you finished reading this? This little girl was surrounded by a piece of paper. Oh, she was attracted by the paper, right? What do you think of this little girl? Do you believe that everyone here can do it? Do you believe that after I finish the class, you will know whether you can do it or not? In fact, in the process of memorizing, she must have used the code. Next, I will analyze how to use the code.

*Slide: The first 10 of the [[https://en.wikipedia.org/wiki/Thirty-Six_Stratagems][Thirty-Six Stratagems]]* 

1. 瞒天过海 to cross the sea by a trick (idiom) / to achieve one's aim by underhanded means
2. 围魏救赵 lit. to besiege 魏 and rescue 趙｜赵 (idiom) / fig. to relieve a besieged ally by attacking the home base of the besiegers
3. 借刀杀人 to lend sb a knife to kill sb / to get sb else to do one's dirty work / to attack using the strength of another (idiom)
4. 以逸待劳 to wait at one's ease for the exhausted enemy / to nurture one's strength and bide one's time (idiom)
5. 趁火打劫 lit. to loot a burning house (idiom) / fig. to take advantage of sb's misfortune
6. 声东击西 to threaten the east and strike to the west (idiom) / to create a diversion
7. 无中生有 to create something from nothing (idiom)
8. 暗渡陈仓 lit. secretly crossing the Wei River 渭河 at Chencang (idiom, refers to a stratagem used by Liu Bang 劉邦｜刘邦 in 206 BC against Xiang Yu 項羽｜项羽 of Chu) / fig. to feign one thing while doing another / to cheat under cover of a diversion
9. 隔岸观火 to watch the fires burning across the river / to delay entering the fray until all others have been exhausted by fighting amongst themselves (idiom)
10.笑里藏刀 lit. a dagger hidden in smiles (idiom); friendly manners belying hypocritical intentions / when the fox preaches, look to the geese

What you see now is from the 36 stratagems. Have you finished reading? Have you finished reading? You have finished reading, right? OK. It is still the first step. The next step is to memorize the information and carry out a forced processing. What do you think of the sea across the sky? The sea across the sky. In fact, it is easy to understand from the dictionary. The sea across the sky. How do you relate to the tree? We can think of a tree. It grows very high and very big. Yes. Then it covers the sky. What do we do under the tree? We cross the sea, right?

<...>

I have already done all of this, I have memorized the 36 stratagems. I also have 100 pictures, not just ten. The 100 pictures means I have more things to encode with. But I still use this method. That is to say, I connect the words with numbers and codes. That is to say, in Chinese, when you type a letter, I can think of what picture is connected with that number, and tell you where it is. Also, when you type a number, you can think of the code, which connects to the picture. I can memorize in both ways.

/Note: the next bit, Wang Feng descibes using [[https://artofmemory.com/blog/mnemonic-links/][the link system]] to memorize idioms by linking the characters one after the other. This does not translate well at all, but it's nothing different from normal./

Now you know the way to use these codes to memorize things. So, it is easy to learn the technique of memory. In addition, I feel sorry to say that there are not many people who master the technique of memory now. For example, I would like to promote the technique of memory. Although I have experienced many difficulties, I still insist on teaching it. I hope more people can benefit from the technique of memory.

** Chinese Major System

/Note: this part has Wang Feng generating little stories for three digit numbers by reading the numbers aloud and changing the tones around + making up names for people based on combining the words for the numbers. It's functionally very similar to the major system used by memory competitors in English, but the translation is somewhat awkward as a result. The important takeaway here is: encoding numbers as words or people, and imagining them instead of the numbers themselves./

*Slide: 5185389015966*

/Note: Wang Feng breaks this into 518, 538, 901, 59, and 66. He comes up with specific substitute words for each of these, and links them together with the story below. I cannot figure out how he arrived at these from the translations, because the api will hear him say the numbers over and over again. The important thing here is that the Chinese equivalent of the major system is easier to understand compared to for English./

Since we are talking about stories, let's start with this one. A widow named Wu (/note: Wu means 5/). Why did she say, I want to send it? Because she drank a bottle of medicine, right? We can also think of 59, because we just said there was no dog. We can think of that she said, I want to send it because there was no dog. It's very popular. But how do we connect this story? We can think of a widow named Wu. She drank a bottle of medicine because there was no dog. She said, I want to send it. After she drank the medicine, she got up and went to Wuchang train station to walk. Can you think of a widow named Wu? She is a drunkard. Can you remember?

Now let's go over the other stories again. Close your eyes and don't look at the screen. First is 518. Then... Let's go in order. First is 518. Next is 538. Then 901. Then 59. Then 66. Very good. It seems that everyone has already remembered these contents.

