org/articles/wangfeng.org
** Method of Loci Using The Body

Alright, I'd like everyone in the audience to stand up. Don't ask me why. After I finish speaking, you will know why I am telling you this. So what you need to do now is to follow me and write it down in your mind. First, touch your head. Everything starts from the head, so you must touch your head. Okay, it's done. Then let's pinch your ears. Hey, audience. You pinch your ears. You don't want to listen to me, do you? Okay, let's touch your eyes. Touch your eyelids. If you don't have eyelids, let's start with the upper eyelids. Okay, let's touch your nose. Let's see how high your nose is. Let's see how high your nose is. Okay, let's touch your mouth. Do you want to try wiping your mouth? If you don't want to, let's do it now. Okay, let's touch your neck. Then, stretch your arms. Okay, let's do it again. Next, I won't demonstrate. You can just do it with your legs. Remember, your whole body should be like this. Don't bend your back. Okay, let's open our big mouth. Then, let's do a knee exercise. Are you happy now? If you are happy, let's do more exercises.

Okay, good. Just now, we did a small clean-up. Now, let's think about what we did just now. Let's start from the beginning. First, touch your eyes. Touch your neck. What's under your neck? Right? Then? <...> Okay, let's do it again. Start from your feet. Feet. Knees. Thighs. Waist. Arms. Neck. Mouth. Nose. Eyes. Ears. Hair. Okay, please sit down.

The next information may be a little confusing. Please raise your hand if you can remember the order of the twelve constellations. Okay. It seems that only a few students can remember. Then, do you have a common topic with these two students or these two students with other students? You can't talk about constellations. Let's memorize the twelve constellations together. How do we do it? We just did a little exercise. Now we will use the body part to memorize them all. First, we will do the joint processing of the information in the memory.

What do you think when you see the white sheep? Sometimes I teach some students. When they talk about the sheep, they tell me about the white sheep. I say, what does the white sheep look like? So when I see the white sheep, I may think of the sheep's feet. I also think of the white, fat, curly hair. Right? What we are going to do is to connect with our head. What do you think? Good. I heard it. It is said that our hair is white and round. It looks like a sheep's hair, right? Good. Remember that our head looks like a sheep's hair. This is the white sheep constellation.

Next, we will look at the golden cow constellation. When we talk about the golden cow constellation, we may only use the word golden cow. Because the last two characters are the word constellation. What do you think of the golden cow? Right. The special feature of the golden cow is its pair of feet, right? Right. We can't see the feet. Next, we are going to use the horse's ears. How does it look like? Let me give you a little hint. The cow's feet are on both sides of the head, right? Right. You got it, right? You got it, right? We also have a pair of cow's feet. We also have a pair of cow's feet. It is the Golden Cow. In our ears, a pair of cow's feet is extended.

<...>

It's like this. The first is Pisces. The second is Aquarius. The third is Capricorn. The fourth is Sagittarius. The fifth is Aquarius. And then, and then, and then.

* My Commentary

There are some relatively simple takeaways from this lecture, since most of the lecture is covering some pretty straightforward common methods for memory.

*We can memorize names and faces by associating their names with characteristics about their face*. I am very bad at this, but my understanding is that the way memory sports people do this event is pretty much the same in the west.

*If everybody knew what their names meant, that would be an easy question to ask*. I'm reminded of people in Japan who have to explain which characters their name is written with, which has always struck me as a lot of additional information to receive about a stranger but likely makes it much easier to remember someone's name when you meet them again.

*We can link numbers together using substitute words*. This seems somewhat easier to do in Mandarin, since 0-9 are all single syllables and you can easily change just tones to get easy substitute words. That is, Ling, yi, er, san, si, wu, liu, qi, ba, and jiu make up 0-9, and because there are four tones every two numbers can yield a wider variety of possible substitute words. One example is 13 -> yi san -> 逸散 (yì sàn) meaning "to vaporize". You can make this even wider by using syllables that sound close to one number and not the others (e.g. jiu -> gou as in the lecture). I am still a beginner at this sort of thing myself, but inventing words via the major system is a bit of a pain in the neck for me, and I can see how simply just reading the numbers aloud with different tones would be straightforward and good.

*You have finished reading, right? OK. It is still the first step. The next step is to memorize the information and carry out a forced processing*. This one stuck with me, more on a broader post about my attempt at learning memory techniques later.

*The body is a location also*. The last part of this is a method of loci demonstration which uses a meditative pass through the body as a "route", which is an interesting take compared to using rooms and roads and stuff. Otherwise, it's pretty similar. We define a path through the body, and we "place" images in parts of the body via exaggerated replacement.

*The techniques are pretty much the same*. There's not really anything in this lecture which is abnormal for the modern memory competitor. I hear that Wang Feng reached sub-2:00 speed cards after practicing from zero for 20 days, at roughly 6-7 hours per day, so like most things like this it seems like you just get better by practicing a lot. 
